---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayColorPower
source: html/e4ce7767-304b-f117-e7a3-da81b2c003dc.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayColorPower Property

The property labeled "Power to compute ray color" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRayColorPower { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".